{
  "basics": {
    "name": "Yi Tian",
    "email": "el561428@u.nus.edu",
    "phone": "+65 8099 1116",
    "website": "https://TIMTIAN66.github.io",
    "summary": "MSc in Biomedical Informatics at National University of Singapore. Research interests include AI for Healthcare, Computational Pathology, and Multimodal Medical AI.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Singapore",
      "countryCode": "SG",
      "region": ""
    },
    "profiles": [
      {
        "network": "Google Scholar",
        "username": "Yi Tian",
        "url": "https://scholar.google.com/citations?user=请替换为你的ID"
      },
      {
        "network": "GitHub",
        "username": "TIMTIAN66",
        "url": "https://github.com/TIMTIAN66"
      }
    ]
  },
  "publications": [
    {
      "name": "Direction-Guided Watershed for Adherent Cell Instance Segmentation",
      "publisher": "ISBI 2026",
      "releaseDate": "2026",
      "website": "",
      "summary": "First-author. Proposed DDBD and OAWA modules to build a direction-guided watershed framework."
    },
    {
      "name": "CellMamba: Adaptive Mamba for Accurate and Efficient Cell Detection",
      "publisher": "BMVC 2025",
      "releaseDate": "2025",
      "website": "",
      "summary": "First-author. Introduced Full Mamba into detection backbone for multi-scale attention fusion."
    },
    {
      "name": "Advancing Cross-Organ Domain Generalization With Test-Time Style Transfer and Diversity Enhancement",
      "publisher": "ISBI 2025",
      "releaseDate": "2025",
      "website": "",
      "summary": "Co-author. Research on domain generalization for medical imaging."
    },
    {
      "name": "BiF³-Net: A Full BiFormer Full-scale Fusion Network for Accurate Gastrointestinal Images Segmentation",
      "publisher": "MIDL 2024",
      "releaseDate": "2024",
      "website": "https://openreview.net/forum?id=kIRMpUufhm",
      "summary": "Co-author. Fusion network for gastrointestinal image segmentation."
    },
    {
      "name": "Convolutional Neural Network-Based Identifying Gender of Kiwifruit Flowers in Autonomous Pollination for Future Farming",
      "publisher": "ICIMR 2023",
      "releaseDate": "2023",
      "website": "https://doi.org/10.1007/978-981-99-8498-5-12",
      "summary": "First-author. CNN-based gender identification for flowers in autonomous farming."
    },
    {
      "name": "Transcriptionally Controlled De Novo Molecular Generation through Hierarchical Gene Encoding and Adaptive Feature Modulation",
      "publisher": "Under Review",
      "releaseDate": "2026",
      "website": "",
      "summary": "Co-author. Research on de novo molecular generation."
    },
    {
      "name": "KPMamba: Token-Level Semantic Alignment for Pose Estimation",
      "publisher": "Manuscript Prepared",
      "releaseDate": "2026",
      "website": "",
      "summary": "First-author (Co-first). Research on semantic alignment for pose estimation."
    },
    {
      "name": "Semantic Alignment in Medical Data: A Survey",
      "publisher": "Manuscript Prepared",
      "releaseDate": "2026",
      "website": "",
      "summary": "First-author (Co-first). A systematic review of semantic alignment in multimodal medical AI."
    }
  ]
}